onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Рассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Рассылки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДПолучатели</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СКДКонтекст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_РежимыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_АктивныеРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_АктивныеРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_КаналыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_КаналыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_РежимыРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_РежимыРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРасписанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписиОбъекта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Рассылки/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьСтандартныеРассылкиЗаписейMAX(Бот) Экспорт

	ПроверитьБотаДляСтандартныхРассылок(Бот);

	НаименованиеОповещения = "MAX: уведомление о новой записи";
	НаименованиеПодтверждения = "MAX: запрос подтверждения записи";

	РассылкаОповещения = НайтиПоНаименованию(НаименованиеОповещения, Истина);
	РассылкаПодтверждения = НайтиПоНаименованию(НаименованиеПодтверждения, Истина);

	Результат = Новый Структура("Создано, УжеСуществовало, Активировано", 0, 0, 0);
	Если Не РассылкаОповещения.Пустая() Тогда
		Результат.УжеСуществовало = Результат.УжеСуществовало + 1;
	КонецЕсли;
	Если Не РассылкаПодтверждения.Пустая() Тогда
		Результат.УжеСуществовало = Результат.УжеСуществовало + 1;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		ИдентификаторыШаблонов = Новый Массив;
		Если РассылкаОповещения.Пустая() Тогда
			ИдентификаторыШаблонов.Добавить("MAX_APPOINTMENT_CREATED");
		КонецЕсли;
		Если РассылкаПодтверждения.Пустая() Тогда
			ИдентификаторыШаблонов.Добавить("MAX_APPOINTMENT_CONFIRM_REQUEST");
		КонецЕсли;
		Если ИдентификаторыШаблонов.Количество() > 0 Тогда
			Справочники.бит_омни_ШаблоныСообщений.СоздатьСтандартныеШаблоныЕслиОтсутствуют(
				ИдентификаторыШаблонов);
			СКДКонтекст = ПолучитьИлиСоздатьСКДКонтекстаЗаписи();
		КонецЕсли;

		Если РассылкаОповещения.Пустая() Тогда
			СКДПолучатели = ПолучитьИлиСоздатьСКДПолучателейЗаписи(Ложь);
			РассылкаОповещения = СоздатьСтандартнуюРассылку(
				НаименованиеОповещения,
				"MAX_APPOINTMENT_CREATED",
				СКДПолучатели,
				СКДКонтекст);
			Результат.Создано = Результат.Создано + 1;
		КонецЕсли;

		Если РассылкаПодтверждения.Пустая() Тогда
			СКДПолучатели = ПолучитьИлиСоздатьСКДПолучателейЗаписи(Истина);
			РассылкаПодтверждения = СоздатьСтандартнуюРассылку(
				НаименованиеПодтверждения,
				"MAX_APPOINTMENT_CONFIRM_REQUEST",
				СКДПолучатели,
				СКДКонтекст);
			Результат.Создано = Результат.Создано + 1;
		КонецЕсли;

		Если АктивироватьРассылкуЕслиНужно(РассылкаОповещения, Бот) Тогда
			Результат.Активировано = Результат.Активировано + 1;
		КонецЕсли;
		Если АктивироватьРассылкуЕслиНужно(РассылкаПодтверждения, Бот) Тогда
			Результат.Активировано = Результат.Активировано + 1;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьБотаДляСтандартныхРассылок(Бот)

	Если Не ЗначениеЗаполнено(Бот) Тогда
		ВызватьИсключение НСтр("ru='Сначала запишите карточку бота.'");
	КонецЕсли;

	ДанныеБота = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Бот, "Канал, Использовать, Токен");
	Если ДанныеБота.Канал <> Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		ВызватьИсключение НСтр("ru='Стандартные рассылки записей можно создать только для бота MAX.'");
	КонецЕсли;

	Если Не ДанныеБота.Использовать Тогда
		ВызватьИсключение НСтр("ru='Включите флаг Использовать и запишите бота.'");
	КонецЕсли;

	Если ПустаяСтрока(ДанныеБота.Токен) Тогда
		ВызватьИсключение НСтр("ru='Укажите токен MAX и запишите бота.'");
	КонецЕсли;

КонецПроцедуры

Функция СоздатьСтандартнуюРассылку(
	НаименованиеРассылки, ИдентификаторШаблона, СКДПолучатели, СКДКонтекст)

	Шаблон = Справочники.бит_омни_ШаблоныСообщений.СтандартныйШаблон(ИдентификаторШаблона);
	Если Шаблон.Пустая() Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru='Не удалось создать стандартный шаблон %1.'"),
			ИдентификаторШаблона);
	КонецЕсли;

	ОбъектРассылки = СоздатьЭлемент();
	ОбъектРассылки.Наименование = НаименованиеРассылки;
	ОбъектРассылки.Шаблон = Шаблон;
	ОбъектРассылки.РежимРассылки = Перечисления.бит_омни_РежимыРассылки.ПриЗаписиОбъекта;
	ОбъектРассылки.СКДПолучатели = Новый ХранилищеЗначения(СКДПолучатели);
	ОбъектРассылки.СКДКонтекст = Новый ХранилищеЗначения(СКДКонтекст);
	СтрокаПринадлежности = ОбъектРассылки.Принадлежность.Добавить();
	СтрокаПринадлежности.Объект = "Документ.Заявка";
	ОбъектРассылки.Записать();

	Возврат ОбъектРассылки.Ссылка;

КонецФункции

Функция АктивироватьРассылкуЕслиНужно(Рассылка, Бот)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_омни_АктивныеРассылки.Рассылка КАК Рассылка
	|ИЗ
	|	РегистрСведений.бит_омни_АктивныеРассылки КАК бит_омни_АктивныеРассылки
	|ГДЕ
	|	бит_омни_АктивныеРассылки.Рассылка = &Рассылка
	|	И бит_омни_АктивныеРассылки.Бот = &Бот";
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	Запрос.УстановитьПараметр("Бот", Бот);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	АктивнаяРассылка = РегистрыСведений.бит_омни_АктивныеРассылки.СоздатьМенеджерЗаписи();
	АктивнаяРассылка.Рассылка = Рассылка;
	АктивнаяРассылка.Бот = Бот;
	АктивнаяРассылка.Записать();

	Возврат Истина;

КонецФункции

Функция ПолучитьИлиСоздатьСКДКонтекстаЗаписи()

	Наименование = "MAX: контекст новой записи";
	СсылкаСКД = Справочники.бит_омни_СхемыКомпоновкиДанных.НайтиПоНаименованию(Наименование, Истина);
	Если Не СсылкаСКД.Пустая() Тогда
		Возврат СсылкаСКД;
	КонецЕсли;

	ОбъектСКД = Справочники.бит_омни_СхемыКомпоновкиДанных.СоздатьЭлемент();
	ОбъектСКД.Наименование = Наименование;
	ОбъектСКД.ХранилищеСКД = Новый ХранилищеЗначения(СоздатьСКДКонтекстаЗаписи(), Новый СжатиеДанных(9));
	ОбъектСКД.Записать();

	Возврат ОбъектСКД.Ссылка;

КонецФункции

Функция ПолучитьИлиСоздатьСКДПолучателейЗаписи(ДляПодтверждения)

	Если ДляПодтверждения Тогда
		Наименование = "MAX: получатели подтверждения записи";
	Иначе
		Наименование = "MAX: получатели уведомления о записи";
	КонецЕсли;

	СсылкаСКД = Справочники.бит_омни_СхемыКомпоновкиДанных.НайтиПоНаименованию(Наименование, Истина);
	Если Не СсылкаСКД.Пустая() Тогда
		Возврат СсылкаСКД;
	КонецЕсли;

	ОбъектСКД = Справочники.бит_омни_СхемыКомпоновкиДанных.СоздатьЭлемент();
	ОбъектСКД.Наименование = Наименование;
	ОбъектСКД.ХранилищеСКД = Новый ХранилищеЗначения(
		СоздатьСКДПолучателейЗаписи(ДляПодтверждения), Новый СжатиеДанных(9));
	ОбъектСКД.Записать();

	Возврат ОбъектСКД.Ссылка;

КонецФункции

Функция СоздатьСКДКонтекстаЗаписи()

	РеквизитыМетаданных = бит_омни_СхемыКомпоновки.ТаблицаРеквизитовМетаданных("Документ.Заявка");
	РеквизитыПередЗаписью = РеквизитыМетаданных.Скопировать();
	РеквизитыПриЗаписи = РеквизитыМетаданных.Скопировать();

	ОтметитьРеквизитыДляСКД(РеквизитыПередЗаписью, СтрРазделить("Ссылка", ",", Ложь));
	ОтметитьРеквизитыДляСКД(РеквизитыПриЗаписи, СтрРазделить(
		"Ссылка,Клиент,ДатаНачала,Сотрудник,Филиал,бит_омни_ЗаписьИзБота", ",", Ложь));

	Схема = бит_омни_СхемыКомпоновки.СхемаПоМетаданным(
		"Документ.Заявка", РеквизитыПередЗаписью, РеквизитыПриЗаписи);

	НаборДанных = ДобавитьНаборДанныхОбъединенный(Схема);
	ДобавитьПолеНабораДанных(
		НаборДанных, "appointment_id", "СсылкаПосле", ТипРеквизита(РеквизитыМетаданных, "Ссылка"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "appointment_date", "ДатаНачалаПосле", ТипРеквизита(РеквизитыМетаданных, "ДатаНачала"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "appointment_time", "ДатаНачалаПосле", ТипРеквизита(РеквизитыМетаданных, "ДатаНачала"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "doctor", "СотрудникПосле", ТипРеквизита(РеквизитыМетаданных, "Сотрудник"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "address", "ФилиалПосле", ТипРеквизита(РеквизитыМетаданных, "Филиал"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "СсылкаДо", "СсылкаДо", ТипРеквизита(РеквизитыМетаданных, "Ссылка"));

	НастроитьВыбранныеПоля(Схема, СтрРазделить(
		"appointment_id,appointment_date,appointment_time,doctor,address", ",", Ложь));
	ДобавитьОтборРавно(Схема, "СсылкаДо", Документы.Заявка.ПустаяСсылка());

	Возврат Схема;

КонецФункции

Функция СоздатьСКДПолучателейЗаписи(ДляПодтверждения)

	РеквизитыМетаданных = бит_омни_СхемыКомпоновки.ТаблицаРеквизитовМетаданных("Документ.Заявка");
	Схема = Новый СхемаКомпоновкиДанных;
	НаборДанных = ДобавитьНаборДанныхОбъединенный(Схема);

	ДобавитьПолеНабораДанных(
		НаборДанных, "Получатель", "КлиентПосле", ТипРеквизита(РеквизитыМетаданных, "Клиент"));
	ДобавитьПолеНабораДанных(
		НаборДанных, "СсылкаДо", "СсылкаДо", ТипРеквизита(РеквизитыМетаданных, "Ссылка"));
	ДобавитьПолеНабораДанных(
		НаборДанных,
		"ЗаписьИзБота",
		"бит_омни_ЗаписьИзБотаПосле",
		ТипРеквизита(РеквизитыМетаданных, "бит_омни_ЗаписьИзБота"));

	НастроитьВыбранныеПоля(Схема, СтрРазделить("Получатель", ",", Ложь));
	ДобавитьОтборРавно(Схема, "СсылкаДо", Документы.Заявка.ПустаяСсылка());
	Если ДляПодтверждения Тогда
		ДобавитьОтборРавно(Схема, "ЗаписьИзБота", Ложь);
	КонецЕсли;

	Возврат Схема;

КонецФункции

Функция ДобавитьНаборДанныхОбъединенный(Схема)

	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанныхОбъединенный";
	НаборДанных.ИмяОбъекта = "НаборДанныхОбъединенный";
	НаборДанных.ИсточникДанных = "ИсточникДанных1";

	Возврат НаборДанных;

КонецФункции

Процедура ДобавитьПолеНабораДанных(НаборДанных, ИмяПоля, ПутьКДанным, ТипЗначения)

	Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = ИмяПоля;
	Поле.ПутьКДанным = ПутьКДанным;
	Поле.ТипЗначения = ТипЗначения;
	Поле.Заголовок = ИмяПоля;

КонецПроцедуры

Процедура НастроитьВыбранныеПоля(Схема, ИменаПолей)

	Схема.НастройкиПоУмолчанию.Выбор.Элементы.Очистить();
	Схема.НастройкиПоУмолчанию.Структура.Очистить();
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ВыбранноеПоле = Схема.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(
			Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЦикла;

	ДетальныеЗаписи = Схема.НастройкиПоУмолчанию.Структура.Добавить(
		Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

КонецПроцедуры

Процедура ДобавитьОтборРавно(Схема, ИмяПоля, Значение)

	ЭлементОтбора = Схема.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
		Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Значение;

КонецПроцедуры

Процедура ОтметитьРеквизитыДляСКД(Реквизиты, ИменаРеквизитов)

	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		СтрокаРеквизита = Реквизиты.Найти(ИмяРеквизита, "Имя");
		Если СтрокаРеквизита = Неопределено Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru='В документе Заявка не найден реквизит %1.'"), ИмяРеквизита);
		КонецЕсли;
		СтрокаРеквизита.Использовать = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ТипРеквизита(Реквизиты, ИмяРеквизита)

	СтрокаРеквизита = Реквизиты.Найти(ИмяРеквизита, "Имя");
	Если СтрокаРеквизита = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru='В документе Заявка не найден реквизит %1.'"), ИмяРеквизита);
	КонецЕсли;

	Возврат СтрокаРеквизита.ТипЗначения;

КонецФункции

#КонецОбласти
